public class Main {
    public static void main(String[] args) {
        /*
        1)Создать массив - пирамидку N x N

        N - Ввводится

        Пример N = 4:
        1
        2 3
        4 5 6
        7 8 9 10

        int [][] arr = new int[5][];


        2) Транспонировать матрицу N x M

        N, M - Ввводится

        Пример:
        1 2 3
        4 5 6

        1 4
        2 5
        4 6

        3) Умножить 2 квадратные
        матрицы (двумерные массивы)

        N x N

        N - Ввводится

        4.1) Сумма элементов на главной диагонали
        двумерного массива N x N

        Пример
        1 2 3
        4 5 6
        7 8 9

        15 и 15

        4.2) Сумма нечётных элементов двумерного массива N x N

        4.3) Построчная сумма элементов двумерного массива N x N
        (результат - одномерный массив)

        Пример
        1 2 3
        4 5 6
        7 8 9

        6 15 24

        */
    }
}
